import { Link } from "react-router";

const GuidePage = () => {
  return (
    <div className="guide-page">
      <div className="guide-title">
        قابل توجه مسئولین راهپیمایی‌های خودرویی، مواکب و شرکت‌کنندگان عزیز
        🚗🔊
      </div>
      <div className="guide-description">
        <p>در راهپیمایی‌های خودرویی معمولاً یک مشکل هست:</p>
        <p>
          صدای ماشین صوت فقط به چند ده متر اول می‌رسد و بقیهٔ مسیر یا چیزی
          نمی‌شنوند، یا هر ماشین صدای جداگانه‌ای پخش می‌کند و هماهنگی کاروان از
          بین می‌رود.
        </p>
        <p>برای حل این مشکل، سامانهٔ منتقمون طراحی شده.</p>
        <p>
          کافی است وارد سایت شوید تا صدا به‌صورت خودکار، همزمان و یک‌دست از
          همهٔ خودروها و باندهای کاروان پخش شود.
        </p>
        <p>یعنی فرقی نمی‌کند اول کاروان باشید یا آخر آن؛</p>
        <p>همه دقیقاً یک صدا و یک زمان را می‌شنوند. ❤️‍🔥</p>
        <p>🔊 چطور استفاده کنیم؟</p>
        <p>1️⃣ گوشی را با AUX یا بلوتوث به سیستم پخش وصل کنید.</p>
        <p>2️⃣ در صفحهٔ اصلی روی «پخش» بزنید.</p>
        <p>از همان لحظه صدا با بقیهٔ کاروان همزمان پخش می‌شود. 💥</p>
        <p>🎧 بخش «ورود به هیئت»</p>
        <p>
          اگر هیئت یا کاروان شما در سامانه ثبت شده باشد، می‌توانید از بخش «ورود
          به هیئت» اسم هیئت خودتان را انتخاب کنید.
        </p>
        <p>در این حالت، مسئول هیئت می‌تواند:</p>
        <p>• مداحی را انتخاب کند</p>
        <p>• صدا را متوقف کند</p>
        <p>• صوت جدید پخش کند</p>
        <p>
          و هر کاری که انجام دهد، همزمان برای همهٔ اعضای هیئت اجرا می‌شود. ⚡
        </p>
        <p>
          ✨ اگر هیئت یا کاروان شما هنوز در سامانه نیست و دوست دارید اکانت مخصوص
          خودتان را داشته باشید تا:
        </p>
        <p>• پخش هماهنگ مخصوص هیئت داشته باشید</p>
        <p>• مداحی‌ها را از راه دور کنترل کنید</p>
        <p>• و همهٔ خودروها با یک کلیک هم‌صدا شوند</p>
        <p>کافی است در پیام‌رسان ایتا پیام بدهید:</p>
        <p style={{ direction: "ltr" }}>
          <Link to={"https://eitaa.com/montaghemonim"} target="_blank">
            📩 @montaghemonim
          </Link>
        </p>
        <p>
          با افتخار در کنار هیئت شما هستیم و کمک می‌کنیم صدای هیئتتون رساتر،
          هماهنگ‌تر و اثرگذارتر شنیده بشه. ✨🙏
        </p>
      </div>
    </div>
  );
};

export default GuidePage;
