import { Link } from "react-router";

const GuidePage = () => {
  return (
    <div className="guide-page">
      <div className="guide-title">
        🎧 راهنمای استفاده از بخش هیئت‌ها و کاروان‌ها
      </div>
      <div className="guide-description">
        <p>
          سامانه‌ی منتقمون طوری طراحی شده که هر کسی فقط با باز کردن سایت،
          به‌صورت خودکار و بدون هیچ تنظیمی، صدای هماهنگ و همزمان با بقیه‌ی
          کاروان رو بشنوه. یعنی فرقی نمی‌کنه اول کاروان باشید یا آخرش؛ همه
          دقیقاً یک صدا، یک ثانیه و یک نوا رو می‌شنون. ❤️‍🔥
        </p>
        <p>
          در بخش (ورود به هیئت)، اگر هیئت یا کاروان شما در سامانه ثبت شده باشه،
          اسمش رو در لیست می‌بینید و می‌تونید وارد بشید تا صوت مخصوص و هماهنگ
          هیئت خودتون رو دریافت کنید؛ صدایی که مسئول هیئت کنترل می‌کنه و هر لحظه
          می‌تونه مداحی رو عوض یا متوقف کنه.
        </p>
        <p>
          اگر هیئت یا کاروان شما هنوز اینجا نیست… اگه دوست دارید هیئت یا کاروان
          خودتون هم توی این سامانه ثبت بشه تا یک اکانت مخصوص کاروان خود دریافت
          کنید
        </p>
        <p>و از قابلیت‌های ویژه مثل</p>
        <p>• پخش همزمان و هماهنگ مخصوص هیئت،</p>
        <p>• کنترل مداحی توسط مسئول هیئت،</p>
        <p>• مدیریت صوت از راه دور،</p>
        <p>• و امکان اتصال همه خودروها با یک کلیک</p>
        <p>استفاده کنید،</p>
        <p>
          فقط کافی هست به آی‌دی زیر در پیام‌رسان ایتا پیام بدید تا براتون اکانت
          هیئت ساخته بشه:
        </p>
        <p style={{direction: "ltr"}}>
          <Link to={"https://eitaa.com/montaghemonim"} target="_blank">📩 @montaghemonim</Link>
        </p>
        <p>
          با افتخار در کنار هیئت شما هستیم و کمک می‌کنیم صدای هیئتتون رساتر،
          هماهنگ‌تر و اثرگذارتر شنیده بشه. ✨🙏
        </p>
      </div>
    </div>
  );
};

export default GuidePage;
